0.57.2119-1/Catalogs/ККСНГ_НоменклатураКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_НоменклатураКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Comment>Код номенклатуры контрагента</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Comment>Наименование номенклатуры контрагента</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Comment>Вид номенклатуры контрагента</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Comment>Ед. изм. номенклатуры контрагента</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Comment>Артикул номенклатуры контрагента</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Comment>Характеристика номенклатуры контрагента</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГУИДХарактеристики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_НоменклатураКонтрагентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает соответствие номенклатурной позиции по данным контрагента
// с проверкой уже существующей записи, если такая запись есть возвращает ИСТИНА
//
// Параметры:
//	Контрагент        			- ссылка - Справочники.ККСНГ_НоменклатураКонтрагентов
//	Номенклатура       			- ссылка - Справочники.Номенклатура 
//	ХарактеристикаНоменклатуры 	- ссылка - Справочники.ХарактеристикиНоменклатуры или Неопределено
//  Код               			- строка - Данные контрагента из структурированного файла
//  Наименование      			- строка - Данные контрагента из структурированного файла
//	Вид               			- строка - Данные контрагента из структурированного файла
//	ЕдИзм             			- строка - Данные контрагента из структурированного файла
//	Артикул           			- строка - Данные контрагента из структурированного файла
//	Характеристика 	  			- строка - Данные контрагента из структурированного файла
//
// Возвращаемое значение: 
//	СтруктураОтвета - см. "ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета"
//   в СтруктураОтвета.Результат - ссылка, неопределенно - Справочники.ККСНГ_НоменклатураКонтрагентов
//
Функция Записать(Контрагент, Номенклатура, ХарактеристикаНоменклатуры = Неопределено, Код = "", Наименование = "", Вид = "", ЕдИзм = "", Артикул = "", Характеристика = "") Экспорт
	
	ИмяГруппыОтвета = "Запись соответствия номенклатуры контрагента " + Строка(Контрагент) + " - " + Строка(Номенклатура);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ИмяГруппыОтвета);
	
	// Поиск уже существующего соответствия
	СуществующееСоответствие = Справочники.ККСНГ_НоменклатураКонтрагентов.ПустаяСсылка();
	ЗапросСоответствия = НайтиСоответствиеНоменклатурыПоДаннымКонтрагента(Контрагент, Код, Наименование, Вид, ЕдИзм, Артикул, Характеристика);
	Если ЗапросСоответствия.Успех Тогда
		СуществующееСоответствие = ЗапросСоответствия.Результат;
		Если СуществующееСоответствие.Номенклатура = Номенклатура И СуществующееСоответствие.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры Тогда 
			// Если такая строка существует, то запись не нужна
			Ответ.Успех = Истина;
			Возврат Ответ;	
		КонецЕсли;
	КонецЕсли;
		
	// Поиск элемента ККСНГ_НоменклатураКонтрагентов
	НайденнаяСсылка = Справочники.ККСНГ_НоменклатураКонтрагентов.НайтиПоРеквизиту("Номенклатура", Номенклатура, , Контрагент);
	
	// Получим объект ККСНГ_НоменклатураКонтрагентов
	Если НайденнаяСсылка = Справочники.ККСНГ_НоменклатураКонтрагентов.ПустаяСсылка() Тогда
		НоменклатураКонтрагентовОбъект = Справочники.ККСНГ_НоменклатураКонтрагентов.СоздатьЭлемент(); 			
	Иначе			
		НоменклатураКонтрагентовОбъект = НайденнаяСсылка.ПолучитьОбъект();		
	КонецЕсли;
	
	// Реквизиты объекта
	НоменклатураКонтрагентовОбъект.Владелец = Контрагент;
	НоменклатураКонтрагентовОбъект.Номенклатура = Номенклатура;
	НоменклатураКонтрагентовОбъект.ПометкаУдаления = Ложь;
	
	// Поиск по всем реквизитам ТЧ кроме GUID характеристики номенклатуры
	СтруктураПоискаДанныхТЧ = ПолучитьСтруктуруПараметровИзДанныхКонтрагента(Код, Наименование, Вид, ЕдИзм, Артикул, Характеристика);
	МассивНайденныхДанныхКонтрагента = НоменклатураКонтрагентовОбъект.ДанныеКонтрагента.НайтиСтроки(СтруктураПоискаДанныхТЧ);
	
	// Если нашли подходящую строку, перезаполняем её, иначе - добавляем новую
	Если МассивНайденныхДанныхКонтрагента.Количество() > 0 Тогда
		НоваяСтрока = МассивНайденныхДанныхКонтрагента[0];
	Иначе
		НоваяСтрока = НоменклатураКонтрагентовОбъект.ДанныеКонтрагента.Добавить();
	КонецЕсли; 
	
	СтруктураДанныхТЧ = ПолучитьСтруктуруПараметровИзДанныхКонтрагента(Код, Наименование, Вид, ЕдИзм, Артикул, Характеристика);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанныхТЧ);
	
	Если ХарактеристикаНоменклатуры = Неопределено Тогда 
		НоваяСтрока.ГУИДХарактеристики = "";
	Иначе
		НоваяСтрока.ГУИДХарактеристики = Строка(ХарактеристикаНоменклатуры.УникальныйИдентификатор());
	КонецЕсли;
	
	// Запись и заполнение структуры ответа
	Если ККСНГ_ОбъектыИБВызовСервера.ЗаписатьНекийОбъект(НоменклатураКонтрагентовОбъект, , Ответ.Журнал) Тогда
		Ответ.Результат = НоменклатураКонтрагентовОбъект.Ссылка;
		Ответ.Успех = Истина;
		
		// Удаление старого соответствия по другой номенклатуре
		Если ЗначениеЗаполнено(СуществующееСоответствие) И (СуществующееСоответствие.Ссылка.Номенклатура <> Номенклатура) Тогда
			Удалить(Контрагент, СуществующееСоответствие.Ссылка.Номенклатура, Код, Наименование, Вид, ЕдИзм, Артикул, Характеристика);
		КонецЕсли;
		
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

// Удаляет соответствие номенклатурной позиции по данным контрагента
//
// Параметры:
//	Контрагент     - ссылка - Справочники.ККСНГ_НоменклатураКонтрагентов
//	Номенклатура   - ссылка - Справочники.Номенклатура 
//  Код            - строка - Данные контрагента из структурированного файла
//  Наименование   - строка - Данные контрагента из структурированного файла 
//	Вид            - строка - Данные контрагента из структурированного файла 
//	ЕдИзм          - строка - Данные контрагента из структурированного файла 
//	Артикул        - строка - Данные контрагента из структурированного файла 
//	Характеристика - строка - Данные контрагента из структурированного файла 
//
// Возвращаемое значение: 
//	СтруктураОтвета - см. "ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета"
//   в СтруктураОтвета.Результат - неопределенно
//
Функция Удалить(Контрагент, Номенклатура, Код = "", Наименование = "", Вид = "", ЕдИзм = "", Артикул = "", Характеристика = "") Экспорт
	
	ИмяГруппыОтвета = "Удаление соответствия номенклатуры контрагента " + Строка(Контрагент) + " - " + Строка(Номенклатура);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ИмяГруппыОтвета);
	
	// Подготовка данных
	СтруктураДанныхТЧ = ПолучитьСтруктуруПараметровИзДанныхКонтрагента(Код, Наименование, Вид, ЕдИзм, Артикул, Характеристика);
	
	// Поиск элемента ККСНГ_НоменклатураКонтрагентов
	НайденнаяСсылка = Справочники.ККСНГ_НоменклатураКонтрагентов.НайтиПоРеквизиту("Номенклатура", Номенклатура, , Контрагент);
	
	// Получим объект ККСНГ_НоменклатураКонтрагентов
	Если Не НайденнаяСсылка.Пустая() Тогда
		
		НоменклатураКонтрагентовОбъект = НайденнаяСсылка.ПолучитьОбъект();		
		
		НайденныеСтроки = НоменклатураКонтрагентовОбъект.ДанныеКонтрагента.НайтиСтроки(СтруктураДанныхТЧ);		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НоменклатураКонтрагентовОбъект.ДанныеКонтрагента.Удалить(НайденнаяСтрока);
			КонецЦикла;
			
			Если ККСНГ_ОбъектыИБВызовСервера.ЗаписатьНекийОбъект(НоменклатураКонтрагентовОбъект, , Ответ.Журнал) Тогда
				Ответ.Результат = НоменклатураКонтрагентовОбъект.Ссылка;
				Ответ.Успех = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Ищет соответствие номенклатурной позиции по данным контрагента
// 
// Параметры:
//	Контрагент     - ссылка - Справочники.ККСНГ_НоменклатураКонтрагентов
//  Код            - строка - Данные контрагента из структурированного файла
//  Наименование   - строка - Данные контрагента из структурированного файла 
//	Вид            - строка - Данные контрагента из структурированного файла 
//	ЕдИзм          - строка - Данные контрагента из структурированного файла 
//	Артикул        - строка - Данные контрагента из структурированного файла 
//	Характеристика - строка - Данные контрагента из структурированного файла 
//
// Возвращаемое значение: 
//	СтруктураОтвета - см. "ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета"
//   в СтруктураОтвета.Результат - ссылка, неопределенно - Справочники.ККСНГ_НоменклатураКонтрагентов
//
Функция НайтиСоответствиеНоменклатурыПоДаннымКонтрагента(Контрагент, Код = "", Наименование = "", Вид = "", ЕдИзм = "", Артикул = "", Характеристика = "") Экспорт
	
	ИмяГруппыОтвета = "Поиск соответствия номенклатуры по данным контрагента " + Строка(Контрагент);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ИмяГруппыОтвета);
	
	// Подготовка данных
	СтруктураДанныхТЧ = ПолучитьСтруктуруПараметровИзДанныхКонтрагента(Код, Наименование, Вид, ЕдИзм, Артикул, Характеристика);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Ссылка КАК Ссылка,
	|	ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.ГУИДХарактеристики КАК ГУИДХарактеристики,
	|	ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Ссылка.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.ККСНГ_НоменклатураКонтрагентов.ДанныеКонтрагента КАК ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента
	|ГДЕ
	|	НЕ ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Ссылка.ПометкаУдаления
	|	И ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Код = &Код
	|	И ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Наименование = &Наименование
	|	И ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Артикул = &Артикул
	|	И ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Характеристика = &Характеристика
	|	И ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Ссылка.Владелец = &Владелец
	|	И ВЫБОР
	|			КОГДА ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Вид <> """"
	|					И &Вид <> """"
	|				ТОГДА ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Вид = &Вид
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.ЕдИзм <> """"
	|					И &ЕдИзм <> """"
	|				ТОГДА ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.ЕдИзм = &ЕдИзм
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	Для Каждого ДанныеНоменклатурыКонтрагента Из СтруктураДанныхТЧ Цикл
		Запрос.УстановитьПараметр(ДанныеНоменклатурыКонтрагента.Ключ, ДанныеНоменклатурыКонтрагента.Значение);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Ответ.Результат = Новый Структура();
		Ответ.Результат.Вставить("Ссылка", Выборка.Ссылка);
		Ответ.Результат.Вставить("Номенклатура", Выборка.Номенклатура);
		Ответ.Результат.Вставить("ХарактеристикаНоменклатуры", ККСНГ_ОбщегоНазначенияВызовСервера.СсылкаПоСтрокеУникальногоИдентификатора(
																								Выборка.ГУИДХарактеристики, "Справочник", "ХарактеристикиНоменклатуры"));
		Ответ.Успех = Истина;
		
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

// Ищет соответствие номенклатурной позиции по данным контрагента для корректировки
//
// Параметры:
//  Контрагент		 - ссылка	 - Справочники.ККСНГ_НоменклатураКонтрагентов
//  Наименование	 - строка	 - Данные контрагента из структурированного файла
//  ЕдИзм			 - строка	 - Данные контрагента из структурированного файла
//  Характеристика	 - строка	 - Данные контрагента из структурированного файла
// 
// Возвращаемое значение:
//  СтруктураОтвета - см. "ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета"
//  в СтруктураОтвета.Результат - ссылка, неопределенно - Справочники.ККСНГ_НоменклатураКонтрагентов
//
Функция НайтиСоответствиеНоменклатурыПоДаннымКонтрагентаДляКорректировки(Контрагент, Наименование, ЕдИзм = "", Характеристика = "") Экспорт
	
	ИмяГруппыОтвета = "Поиск соответствия номенклатуры для корректировки по данным контрагента " + Строка(Контрагент);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ИмяГруппыОтвета);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Ссылка КАК Ссылка,
	|	ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.ГУИДХарактеристики КАК ГУИДХарактеристики,
	|	ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Ссылка.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.ККСНГ_НоменклатураКонтрагентов.ДанныеКонтрагента КАК ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента
	|ГДЕ
	|	НЕ ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Ссылка.ПометкаУдаления
	|	И ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Ссылка.Владелец = &Владелец
	|	И ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Характеристика = &Характеристика
	|	И ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.Наименование = &Наименование
	|	И ВЫБОР
	|			КОГДА ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.ЕдИзм <> """"
	|					И &ЕдИзм <> """"
	|				ТОГДА ККСНГ_НоменклатураКонтрагентовДанныеКонтрагента.ЕдИзм = &ЕдИзм
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("ЕдИзм", ЕдИзм);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() = 1 И Выборка.Следующий() Тогда
			
			Ответ.Результат = Новый Структура();
			Ответ.Результат.Вставить("Ссылка", Выборка.Ссылка);
			Ответ.Результат.Вставить("Номенклатура", Выборка.Номенклатура);
			Ответ.Результат.Вставить("ХарактеристикаНоменклатуры", ККСНГ_ОбщегоНазначенияВызовСервера.СсылкаПоСтрокеУникальногоИдентификатора(
																								Выборка.ГУИДХарактеристики, "Справочник", "ХарактеристикиНоменклатуры"));
			Ответ.Успех = Истина;

			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруПараметровИзДанныхКонтрагента(Код, Наименование, Вид, ЕдИзм, Артикул, Характеристика)
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("Код", Код);
	СтруктураДанных.Вставить("Наименование", Наименование);
	СтруктураДанных.Вставить("Вид", Вид);
	СтруктураДанных.Вставить("ЕдИзм", ЕдИзм);
	СтруктураДанных.Вставить("Артикул", Артикул);
	СтруктураДанных.Вставить("Характеристика", Характеристика);
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
